var RegExp = {
  rules: {    
    //身份证号码
    idCard: /^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])((\d{4})|\d{3}[A-Z])$/,
    //香港身份证号码
    HKIdCard:/^([A-Z]\d{6}(\(\w{1}\))?)$/,
    //澳门身份证号码
    MCIdCard:/^[1|5|7][0-9]{6}\([0-9]\)/,
    //台湾身份证号码
    TWIdCard:/^[A-Z][1|2][0-9]{8}$/,
    //军官证
    officer: /^[a-zA-Z0-9]{7,21}$/,
    //护照
    passport1: /^[a-zA-Z0-9]{3,21}$/,
    passport2: /^(P\d{7})|(G\d{8})$/,
    //港澳台证
    hmtPass: /^[a-zA-Z0-9]{5,21}$/,

    //手机号码
    mobile: /^1[3-9]\d{9}$/,
    //座机电话
    tel: /^(0[0-9]{2,3}\-)?([2-9][0-9]{6,7})+(\-[0-9]{1,4})?$/,
    //邮政编码
    postcode: /^[1-9]\d{5}$/,

    //电子邮箱
    email: /^[\w\+-]+(\.[\w\+-]+)*@[a-z\d-]+(\.[a-z\d-]+)*\.([a-z]{2,4})$/i,
    //只能输入数字
    digits: /^\d+$/,
    //只能输入字母
    letters: /^[a-z]+$/i,    
    //只能输入中文 中文字符
    chinese: /^[\u0391-\uFFE5]+$/,
    //只能输入中文
    chinese1: /^[\u4e00-\u9fa5]+$/,
    //用户名由4-16位数字、字母、下划线组成
    username: /^\w{4,16}$/, 
    //密码由6-12位数字、字母组成
    password: /^[0-9a-zA-Z]{6,12}$/,
    //匹配正整数或者小数,小数点后不超过两位
    twoDecimal: /^\d+(\.\d{1,2})?$/,
    //匹配正整数或者小数,小数点后不超过六位
    sixDecimal: /^\d+(\.\d{1,6})?$/,
  }
};

module.exports = RegExp;